Revit 2015 API
StructuralSectionRectangular Members
The StructuralSectionRectangular type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from StructuralSection.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
CentroidHorizontal
 Distance from centroid to the left extremites along horizontal axis.
CentroidVertical
 Distance from centroid to the upper extremites along vertical axis.
ElasticModulusStrongAxis
 Elastic section modulus about main strong axis for calculation of bending stresses.
ElasticModulusWeakAxis
 Elastic section modulus about main weak axis for calculation of bending stresses.
Height
 Section height, depth.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from StructuralSection.)
MomentOfInertiaStrongAxis
 Moment of Inertia about main strong axis (I).
MomentOfInertiaWeakAxis
 Moment of Inertia about main weak axis (I).
NominalWeight
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Perimeter
 Painting surface of the unit length.
PlasticModulusStrongAxis
 Plastic section modulus in bending about main strong axis (Z, Wpl)
PlasticModulusWeakAxis
 Plastic section modulus in bending about main weak axis.
PrincipalAxesAngle
 Rotation angle between the principal axes and cross section reference planes.
SectionArea
 Cross section area.
ShearAreaStrongAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
ShearAreaWeakAxis
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
StructuralSectionShape
 The type of structural section shape.
 (Inherited from StructuralSection.)
StructuralSectionShapeName
 A human readable string representing the structural section shape.
 (Inherited from StructuralSection.)
TorsionalModulus
 Section modulus for calculations of torsion stresses (Ct)
TorsionalMomentOfInertia
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
WarpingConstant
 Warping constant (Cw, Iomega, H)
Width
 Section width.
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace